#include "iostream"

using namespace std;

int main() {
    const int M = 2, K = 3, L = 2; // Розміри матриць
    int A[M][K] = {{1, 2, 3},
                   {4, 5, 6}};
    int B[K][L] = {{10, 11},
                   {20, 21},
                   {30, 31}};
    int C[M][L]; // Результуюча матриця

// Потрійний цикл
    for (int i = 0; i < M; i++) {         // Проходимо по рядках матриці A
        for (int j = 0; j < L; j++) {     // Проходимо по стовпцях матриці B
            C[i][j] = 0;                  // Обнуляємо акумулятор суми
            for (int k = 0; k < K; k++) { // Скалярний добуток рядка на стовпець
                C[i][j] += A[i][k] * B[k][j];
            }
        }
    }
    // Виведення результату
    cout << "Результат множення матриць A і B (матриця C):" << endl;
    for (int i = 0; i < M; i++) {
        for (int j = 0; j < L; j++) {
            cout << C[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}