#include "iostream"

int main() {
// Варіант 1: Автоматичний розмір
// Компілятор сам порахує: 3 літери + 1 нуль = 4 байти
    char s1[] = "Cat";

// Варіант 2: Явний розмір
// Ми виділяємо місце для 10 символів.
// "Cat" займе перші 3 + нуль. Решта пам'яті буде невикористана (сміття або нулі).
    char s2[10] = "Cat";

// Варіант 3: Посимвольно (Дуже незручно, але можливо)
// Тут ми зобов'язані самі поставити '\0', інакше це не буде рядком!
    char s3[] = {'C', 'a', 't', '\0'};

    // ПОМИЛКА!
// Слово "Hello" має 5 літер, але масиву треба 6 комірок (5 + 1).
//    char s[5] = "Hello"; // Це викличе помилку компіляції або збій програми.

    char s[6] = "Hello"; // Або просто char s[] = "Hello";
    const char* ptr = str.c_str();

    return 0;
}
