#include <iostream>

int main() {
    int rows, cols;
    std::cout << "Введіть кількість рядків та стовпців: ";
    std::cin >> rows >> cols;

// 1. Створюємо масив вказівників (каркас).
// Тип int** означає "вказівник на масив вказівників типу int"
    int **matrix = new int *[rows];

// 2. У циклі створюємо кожен окремий рядок
    for (int i = 0; i < rows; ++i) {
        matrix[i] = new int[cols];
    }

// Тепер з цією матрицею можна працювати як зі звичайною!
    matrix[0][0] = 42;

    // 1. Спочатку знищуємо кожен рядок
    for (int i = 0; i < rows; ++i) {
        delete[] matrix[i];
    }

// 2. Тільки після цього знищуємо сам масив вказівників
    delete[] matrix;

// 3. Зануляємо вказівник для безпеки
    matrix = nullptr;

}