#include <iostream>
int main(){
    // 1. Виділення пам'яті для одного цілого числа
    int* pAge = new int;

// Можна одразу ініціалізувати значенням:
    int* pScore = new int(100);

    *pAge = 25; // Записуємо значення за адресою
    std::cout << "Вік: " << *pAge << "\n";

// 2. Звільнення пам'яті
    delete pAge;
    delete pScore;

// 3. ПРАВИЛО ХОРОШОГО ТОНУ: занулення вказівника
// Після delete вказівник все ще зберігає стару адресу (тепер це "висячий вказівник").
// Щоб випадково не зіпсувати пам'ять, завжди присвоюйте йому nullptr.
    pAge = nullptr;
    pScore = nullptr;
}