#include "iostream"

union Data {
    int i;
    double d;
    char c;
};

int main() {
    Data val;

    // Крок 1. Записуємо ціле число
    val.i = 100;
    std::cout << "Поле i: " << val.i << std::endl; // Виведе: 100

    // Крок 2. Записуємо дробове число у ТУ САМУ пам'ять
    val.d = 3.1415;
    std::cout << "Поле d: " << val.d << std::endl; // Виведе: 3.1415

    // Крок 3. Намагаємось прочитати старе ціле число
    // УВАГА! Виведе якесь випадкове "сміття", бо байти числа 100
    // були перезаписані байтами числа 3.1415!
    std::cout << "Поле i після запису d: " << val.i << std::endl;

    // Крок 4. Записуємо символ
    val.c = 'A';
    std::cout << "Поле c: " << val.c << std::endl; // Виведе: A
    // Тепер зруйновано і поле val.d...

    return 0;
}