#include <iostream>

// ==========================================
// 1. БЛОК ПРОТОТИПІВ (Оголошення функцій)
// ==========================================
int multiply(int a, int b);

void printResult(int res);

// ==========================================
// 2. ГОЛОВНА ФУНКЦІЯ (Точка входу)
// ==========================================
int main() {
    int x = 5;
    int y = 4;

    // Викликаємо функції. Компілятор вже знає про них завдяки прототипам!
    int result = multiply(x, y);
    printResult(result);

    return 0;
}

// ==========================================
// 3. БЛОК ВИЗНАЧЕНЬ (Реалізація функцій)
// ==========================================
int multiply(int a, int b) {
    return a * b;
}

void printResult(int res) {
    std::cout << "Результат: " << res << std::endl;
}
