#include <iostream>

// Визначення функції
int multiply(int x, int y) {
    return x * y; // Одразу повертаємо результат множення
}

// Функція типу void (нічого не повертає)
void sayHello() {
    std::cout << "Привіт! Я функція, яка просто виводить текст." << std::endl;
    // return тут не обов'язковий, функція завершиться сама в кінці
}

int main() {
    sayHello(); // Виклик функції без параметрів

    int a = 5;
    int b = 4;

    // Виклик функції. Результат її роботи записуємо у змінну res
    int res = multiply(a, b);

    std::cout << "Результат множення: " << res << std::endl;

    // Можна викликати функцію прямо всередині виводу:
    std::cout << "10 * 10 = " << multiply(10, 10) << std::endl;

    return 0; // Завершення головної функції програми
}
